app/controllers/bin_reports_controller.rb

SELECT 1 AS one FROM `bin_reports` WHERE (sn = '96172211977') LIMIT 1
SELECT `bin_reports`.* FROM `bin_reports` WHERE (sn = '96172211977')
INSERT INTO `search_histories` (`id`, `time`, `name`, `model`, `sn`, `current`, `bin`, `created_at`, `updated_at`) VALUES ('b0b1dd11-c7f0-4f6f-93dc-fc25814c3d9d', '2020/12/29 22:07', 'AHB Cell Pack', 'AHB74490HPC', '96172211977', 0.3546, 'B3', '2021-08-04 09:48:12', '2021-08-04 09:48:12')
---
	def index
		if !query_params.empty? && !query_params[:text].blank?
			@bin_reports = BinReport.filtered(query_params)

			if !@bin_reports.empty?
				SearchHistory.insert_record(@bin_reports)